In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine
import getpass

In [2]:
password = getpass.getpass()

········

1. Establish a connection between Python and the Sakila database

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM loan', engine)
data.head()

   loan_id  account_id    date  amount  duration  payments status
0     5314        1787  930705   96396        12    8033.0      B
1     5316        1801  930711  165960        36    4610.0      A
2     6863        9188  930728  127080        60    2118.0      A
3     5325        1843  930803  105804        36    2939.0      A
4     7240       11013  930906  274740        60    4579.0      A

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. 
The function should take in three parameters:
- engine: an object representing the database connection engine to be used to establish a     connection to the Sakila database.
- month: an integer representing the month for which rental data is to be retrieved.
- year: an integer representing the year for which rental data is to be retrieved.

The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [24]:
def rentals_month(engine, month, year):

    query = f"""
        SELECT *
        FROM sakila.rental
        WHERE month(rental_date) = {month}
        AND year(rental_date) = {year}
    """
   
    rental_data = pd.read_sql_query(query, engine)
    
    return rental_data

In [25]:
rentals_month_result=rentals_month(engine, month=5, year=2005)
rentals_month_result.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year, and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [ ]:
#SQL Request :
"""
SELECT customer_id, COUNT(*) AS rental_count FROM sakila.rental
WHERE month(rental_date) = 7
AND year(rental_date) = 2005
GROUP BY customer_id;
"""

In [31]:
def rental_count_month(rental_data, month, year):
    
    rental_data_filtered = rental_data[(rental_data['rental_date'].dt.month == month) & (rental_data['rental_date'].dt.year == year)]

    rentals_by_customer = rental_data_filtered.groupby('customer_id').size().reset_index(name=f'rentals_{month:02d}_{year}')

    return rentals_by_customer

In [33]:
result_july_2005_counts = rental_count_month(rentals_month_result, month=5, year=2005)
display(result_july_2005_counts)

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

Befor answering this question, I have to say that when I make the request "SELECT * FROM sakila.rental WHERE MONTH(rental_date) = number AND YEAR(rental_date) = number;", I have a result with month 5, 6, 7 anf year 2005, but not with other years or month... 
So I have not much to compare ;)

In [34]:
def compare_rentals(df1, df2):
    # Merge the two DataFrames on 'customer_id'
    merged_df = pd.merge(df1, df2, on='customer_id', how='outer', suffixes=('_left', '_right'))

    merged_df = merged_df.fillna(0)

    merged_df['difference'] = merged_df[f'rentals_{df1.columns[-1].split("_")[-2]}_{df1.columns[-1].split("_")[-1]}'] - merged_df[f'rentals_{df2.columns[-1].split("_")[-2]}_{df2.columns[-1].split("_")[-1]}']

    return merged_df

In [37]:
result_june_2005 = rental_count_month(rentals_month_result, month=6, year=2005)
result_july_2005 = rental_count_month(rentals_month_result, month=7, year=2005)

comparison_result = compare_rentals(result_june_2005, result_july_2005)
display(comparison_result)

Empty DataFrame
Columns: [rentals_06_2005, customer_id, rentals_07_2005, difference]
Index: []

I don't kwow why there is nothing in this dataframe !